app/views/students/show.html.erb


  <% @student.enrollments.each do |enrollment| %>
---
SELECT `enrollments`.* FROM `enrollments` WHERE `enrollments`.`student_id` = 1