app/views/teachers/show.html.erb

SELECT `courses`.* FROM `courses` WHERE `courses`.`teacher_id` = 1
---

  <% @teacher.courses.each do |course| %>

SELECT COUNT(*) FROM `enrollments` WHERE `enrollments`.`course_id` = 1
---
      <td><%= session_output(course.session) %></td>
      <td><%= course.enrollments.count %></td>