app/views/courses/index.html.erb

SELECT COUNT(*) FROM `enrollments` WHERE `enrollments`.`course_id` = 1
---
    <td><%= course.teacher.name %></td>
    <td><%= course.enrollments.count %></td>