app/views/courses/show.html.erb


  <% @course.enrollments.each do |enrollment| %>
---
SELECT `enrollments`.* FROM `enrollments` WHERE `enrollments`.`course_id` = 1

      <td><%= enrollment.student.name %></td>
      <td><%= enrollment.student.phone_numbers.first.number rescue nil %></td>
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1