app/controllers/courses_controller.rb

  def show
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1

  def edit
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 3 LIMIT 1

  def start
    @course = Course.find(params[:id])
    @course.update_attribute(:start_date, Date.today)
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 3 LIMIT 1
UPDATE `courses` SET `start_date` = '2011-11-15', `status` = 2, `updated_at` = '2011-11-14 23:41:40' WHERE `courses`.`id` = 3