app/controllers/enrollments_controller.rb

  def index
    @enrollments = Enrollment.all
---
SELECT `enrollments`.* FROM `enrollments`

  def show
    @enrollment = Enrollment.find(params[:id])
---
SELECT `enrollments`.* FROM `enrollments` WHERE `enrollments`.`id` = 1 LIMIT 1

  def create
    @enrollment = Enrollment.new(params[:enrollment])

    respond_to do |format|
      if @enrollment.save
---
INSERT INTO `enrollments` (`course_id`, `created_at`, `student_id`, `updated_at`) VALUES (3, '2011-11-14 20:13:41', 1, '2011-11-14 20:13:41')