app/controllers/payments_controller.rb

SELECT `payments`.* FROM `payments`
---
  def index
    @payments = Payment.all

SELECT `payments`.* FROM `payments` WHERE `payments`.`id` = 1 LIMIT 1
---
  def show
    @payment = Payment.find(params[:id])

SELECT `payments`.* FROM `payments` WHERE `payments`.`id` = 2 LIMIT 1
UPDATE `payments` SET `status` = 1, `updated_at` = '2011-11-19 14:39:20' WHERE `payments`.`id` = 2
---
  def make_payment
    @payment = Payment.find(params[:id])
    @payment.update_attribute(:status, true) ? flash[:notice] = 'Payment successfully made.' : flash[:notice] = 'Error in processing payment.'