app/controllers/students_controller.rb

  def edit
    @student = Student.find(params[:id])
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1

  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save
---
INSERT INTO `students` (`address`, `created_at`, `fee_status`, `name`, `phone_number`, `registration_fee`, `updated_at`) VALUES ('Gulshan', '2011-11-13 13:24:55', 0, 'Shirjeel', '---\nnumber: \'03332463936\'\ntype: \'0\'\n', NULL, '2011-11-13 13:24:55')

  def update
    @student = Student.find(params[:id])
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1